[
	{
		"items": [
			{
				"id": "97766325",
				"thumb": "http://i.vimeocdn.com/video/478261140_100x75.jpg",
				"title": "Patrick Seda - Gamification vs Motivation in Children's Apps (tiConf US 2014)",
				"description": "One of the best ways to keep a mobile app user engaged is through gamification and a well thought-out reward system. Accomplish certain goals, and you'll be rewarded with anything from points to badges to real world goods. But the real satisfaction is through elevating your social status? be the best amongst your friends!<br />\n<br />\nThis is most certainly true in mobile games. But does it really hold up in the domain of children's games? Perhaps, but not all gamification is created equal when targeting children. The games must be fun, engaging, and keep a child wanting more. But what is the 'more' that you should actually be targeting?"
			}, {
				"id": "97758718",
				"thumb": "http://i.vimeocdn.com/video/478253301_100x75.jpg",
				"title": "Pratik Patel - Working With Data in Titanium (tiConf US 2014)",
				"description": "Titanium has a host of options for storing application and user data. In this session, we'll look at some of these options, such as simple JSON and SQLite. We will also discuss the details of deciding to use SQL or a NoSQL solution. We'll look at how to architect a data-driven mobile app, strategies for server synchronization, and take a deep dive into working with datasets in JavaScript."
			}, {
				"id": "97130505",
				"thumb": "http://i.vimeocdn.com/video/477411826_100x75.jpg",
				"title": "Ali Abdullah - Forgetting Old Habits (tiConf US 2014)",
				"description": "Know your users. Know their habits - develop case studies that solves QA issues - ensuring that the users is at the core of every decision."
			}, {
				"id": "97049408",
				"thumb": "http://i.vimeocdn.com/video/477342207_100x75.jpg",
				"title": "Josh Jensen - Titanium Best Practices (tiConf US 2014)",
				"description": "Many people that come to Titanium and Alloy come to it from a background in web development. Having that as a background is great but often times it is lacking in some basic disciplines that are important for success. Success not only in the initial development but also the long term maintenance and upkeep of the app you are building.<br />\r\n<br />\r\nWhen working with frameworks like Titanium or Node.js, it?s easy to have a fire and forget mentality. These frameworks make it so simple to get to ?hello world? that sometimes we forget how important best practices are. <br />\r\n<br />\r\nIn this session I will take you through some of the beginning best practices that have helped me maintain thousands of apps and tens of thousands of lines of code. I have made a lot of mistakes and will try to help you avoid as many of those pitfalls as possible.<br />\r\n<br />\r\nThis session will be specifically geared for the person that is relatively new to Titanium and/or Alloy and will address things like application structure for Classic and Alloy based applications. The plan is to answer questions like, how and when do I use a window vs. a view? What does it mean to open a window with a different context? How do I use commonJS modules effectively? What is a global event listener and why do people tell me not to use them? How do I get help, and why won?t anyone answer my questions in the support forums?<br />\r\n<br />\r\nIf you want to love working with Titanium for a long time to come, check out some of the best practices that will help you get there."
			}, {
				"id": "97049407",
				"thumb": "http://i.vimeocdn.com/video/477323987_100x75.jpg",
				"title": "Jamil Hassan Spain - Documenting Your Titanium Applications (tiConf US 2014)",
				"description": "We all know documentation for software projects is critical for a number of reasons.  More specifically, how can you properly document your Titanium Mobile Applications?  Enter the npm module titanium-jsduck to save the day. This session will involve integration of this module for your titanium mobile applications and show how to properly document your code to generate documentation."
			}, {
				"id": "96903780",
				"thumb": "http://i.vimeocdn.com/video/477113095_100x75.jpg",
				"title": "Matt Apperson, Faster, Better, Stronger App Development with RapidDev  (tiConf US 2014)",
				"description": "Learn how to use RapidDev by Apperson Labs to speed up your development of Titanium apps as well as improve your ability to test your apps cross platform."
			}, {
				"id": "96898505",
				"thumb": "http://i.vimeocdn.com/video/477093062_100x75.jpg",
				"title": "Adam Paxton - Creating Custom Maps for Titanium using Mapbox & OpenStreetMap  (tiConf US 2014)",
				"description": "Why would you want or need a custom map? Consider the following possibilities:<br />\n<br />\n<br />\n• You are designing the official tour guide app for your Secret Island Fortress, painstakingly selecting every color and tint to properly evoke just how secret, how fortified - how intimidating! - your island really is, only to drop in a map colored with pretty blues, and greens and tans. Kind of kills the mood.<br />\n• Or perhaps your Secret Island Fortress is a little too secret, and your current map provider has incorrectly labeled the road to the Welcome Center as the road to the dungeon. Maybe the island isn't on the map at all! <br />\n• Worse yet, when your visitors do arrive, they won't be able to see your map anyway, because the data plans are spotty way out here, and the wifi doesn't reach out to the garden walking path, much less the underground missile silo (when the hatch is closed).<br />\n<br />\nIn this session we will have an overview on:<br />\n• Using the Mapbox TileMill tool to design our map with CSS-based styling that even we non-designers can handle.<br />\n• Importing custom data into TileMill from our own sources or OpenStreetMap using GeoJSON, KML, PostGIS, SQLite, CSV, you name it<br />\n• Bundling it all up in mbtiles format to use in our app with the Mapbox iOS SDK (wrapped in a Titanium module, of course) and host it online or in the app for offline use."
			}, {
				"id": "96893791",
				"thumb": "http://i.vimeocdn.com/video/477086981_100x75.jpg",
				"title": "Alex Otanez, Shockoe, Beginning with the End in Mind - A Roadmap to the Enterprise  - tiConf US 2014",
				"description": "As the Enterprise Begins to Shift its thinking about mobile applications and the mobile ecosystem, Appcelerator partners are primed to take advantage of this trend. I want to talk about how we are using GPS, improved UI/UX, CRM, and other tools to help the enterprise extend mobile applications to field support, sales teams, and other remote workers. <br />\n<br />\n• When working with clients, we always begin with the end in mind ensuring a more successful enterprise implementation, in this session we will cover:<br />\n• Designing a Mobile Ecosystem: Helping clients understand the value of a mobile ecosystem through app requirements and a mobile architecture<br />\n• The Business Case and Mobile Roadmap: Using the Appcelerator tool kit to create a business case and working with the client to establish a mobile roadmap with the end in mind<br />\n• Total Cost of Ownership: How to help clients see value in Appcelerators platform by presenting the Total Cost of Ownership"
			}, {
				"id": "96800013",
				"thumb": "http://i.vimeocdn.com/video/476962004_100x75.jpg",
				"title": "Tony Lukasavage, Alloy Keynote   - tiConf US 2014",
				"description": "The Day #2 keynote about the upcoming features and changes to Titanium Alloy at tiConf US 2014"
			}, {
				"id": "96791096",
				"thumb": "http://i.vimeocdn.com/video/476949576_100x75.jpg",
				"title": "Alexander Chatterjee, Wearable Devices - tiConf US 2014",
				"description": "Wearable technology are here, if we want it or not! During this talk, we'll focus on two type of devices: the sport trackers and the smart watches.<br />\n<br />\nDuring the first part of the session, we shall see how to collect information from wrist bands like the JawBone UP or the FitBit and integrate them in your mobile application in order to create another user experience than the core application like the UP (rather than just count the number step, we could retrieve information like the number of flexes of your muscles).<br />\n<br />\nA second part of the session will be more focused on smart watches: where are their limits, can we provide a new type of interaction for the end user using the small devices screen; some examples will be shown using the SONY smartwatch."
			}, {
				"id": "96789887",
				"thumb": "http://i.vimeocdn.com/video/476951289_100x75.jpg",
				"title": "Stephen Feather - Using BLE to Enhance User Engagement, tiConf US 2014",
				"description": "This session will introduce Titanium Developers to a number of different ways in which they can use BLE technology to increase user engagement. We will look at using BLE in Retail, Education, and the Arts.<br />\r\n<br />\r\nView Stephen's slides at http://www.slideshare.net/stephenfeather/ticonf2014-bleuserenhancement<br />\r\nView the source code for this presentation at https://github.com/sfeather/ticonf2014-ble-user-engagement"
			}, {
				"id": "96695416",
				"thumb": "http://i.vimeocdn.com/video/476822951_100x75.jpg",
				"title": "Olivier Morandi - Debugging & Profiling Titanium Apps, tiConf US 2014",
				"description": "Have you ever felt the need to know exactly what's going on during the execution of a Titanium app? What tools or techniques did you use? Adding logging statements to your code for either debugging or profiling purposes can be a last resort solution, but it isn't surely the most flexible. In some scenarios, native development tools can come to help, but they only tell us half of the truth, since they aren?t able to show us what's happening in JS land.<br />\n<br />\nIn this talk I'll present some tools and techniques that allow us to have a clear look at what?s happening under the hood while a Titanium application is running. In particular, we?ll see how to use Chrome DevTools and Ti Inspector (https://github.com/omorandi/TiInspector), as well as additional tools and plugins for debugging, tracing and profiling our applications."
			}, {
				"id": "96681431",
				"thumb": "http://i.vimeocdn.com/video/476806661_100x75.jpg",
				"title": "Jason Kneen, Adventures in Cross Platform - tiConf US 2014",
				"description": "I wanted to talk about my own experience in developing apps for primarily, iOS and Android (with some mobile web too), the common mistakes that I've made and learnt from (and I think many Titanium developers make), regarding approach, design, coding, commercial arrangements, publishing, delivery of beta's etc.<br />\r\n<br />\r\nProbably aimed at beginners to intermediates, or even capable Titanium developers who might be focusing on one platform, getting stuck in iOS or Android mode and struggling to cope with the other.<br />\r\n<br />\r\nNot only cross-platform but cross-device too so iPhone / iPad, Android phone and tablet<br />\r\n- UI/UX mistakes<br />\r\n- Coding around cross-platform<br />\r\n- Retina, Density issues<br />\r\n- Delivery / Testing<br />\r\n- Optimisation<br />\r\n- Publishing<br />\r\n- Commercial arrangements (how to not get screwed if they can the Android version)<br />\r\n<br />\r\nSo giving advice like how to ensure your Android apk is not being published with all your iOS retina images, making it several megabytes larger than it needs to be.<br />\r\n- How to ensure your layouts are consistent using fluid / density independent layouts.<br />\r\n- How to not get fucked when your client cancels the Android project OR wants to go live with iOS or Android first<br />\r\n- How to ensure you don't get into a locked insyndrome developing wtih iOS and iPhone namespaces to then spend days converting to Android later<br />\r\n- Using Alloy app.tss and TSS and cross-platform base controllers to make your life easier<br />\r\n<br />\r\nJason's slides are available from https://speakerdeck.com/jasonkneen/adventures-in-cross-platform<br />\r\nJason's GIT repositories as discussed here is available at https://github.com/jasonkneen/TiConfUS14WorkshopApp and https://gist.github.com/jasonkneen/1f5797959659c94326f8"
			}, {
				"id": "96680337",
				"thumb": "http://i.vimeocdn.com/video/476804276_100x75.jpg",
				"title": "Trevor Ward at tiConf US 2014 - Genymotion",
				"description": "In this session Trevor discusses Genymotion - the android emulator you can actually use.<br />\r\n<br />\r\nFor a full interview with Trevor, visit http://www.tidev.io/2014/05/01/ticonf-speaker-trevor-ward/"
			}, {
				"id": "96593909",
				"thumb": "http://i.vimeocdn.com/video/476691591_100x75.jpg",
				"title": "Jeff Haynie, CEO Appcelerator, gives the keynote talk on Day 1 of tiConf US, 2014 (NYC)",
				"description": ""
			}, {
				"id": "96590732",
				"thumb": "http://i.vimeocdn.com/video/476687770_100x75.jpg",
				"title": "John Gould (Codex Labs) - Game Development and Gamification with Titanium, Platino and Hyperloop",
				"description": "The barriers to entry into game development are falling away, and Titanium with Platino eliminates many development and cost hurdles to getting your game ideas onto mobile platforms. And with Appcelerator's new Hyperloop compiler, app performance on Titanium-developed apps has finally reached, and in some cases, exceeded 'native-developed' apps, but with the coding simplicity and cross-platform compatibility of Titanium. Learn how to get started with these tools and sidestep the complexities of game development so you can get right to the core gameplay elements and mechanics that were previously out of reach for most developers.<br />\r\n<br />\r\nJohn will be demonstrating game development techniques with Titanium and Platino and will also show how these techniques can make business-related and 'serious' applications more fun and engaging for the end user by incorporating game mechanics into everyday apps."
			}, {
				"id": "96586000",
				"thumb": "http://i.vimeocdn.com/video/476676070_100x75.jpg",
				"title": "tiConf US Intro Video 2014",
				"description": "tiConf US Intro Video 2014 (New York)"
			}, {
				"id": "96585969",
				"thumb": "http://i.vimeocdn.com/video/476681799_100x75.jpg",
				"title": "Grant Shipley - Red Hat OpenShift Mobile Keynote at tiConf US 2014 (New York)",
				"description": "Scaling Your Back-End<br />\r\n----------------------------------------<br />\r\nWhether you have one or a million visitors accessing your mobile app, they are all going to demand a great user experience regardless of what it takes for you to deliver it. This invariably means quick loads and fast response times every single time. When things go south, you just throw more hardware at the problem and increase your caches and buffers, right? Wrong. Toss in an infrastructure that resides on the cloud and now you've got a really interesting problem on your hands. I'll leave the marketecure slides at the door, this is a hands-on technical talk in which we'll deploy an application to the cloud and then turn up the heat by leveraging the right mix of elasticity and auto-scaling."
			}
		],
		"title": "tiConf US 2014 - New York"
	}, {
		"items": [
			{
				"id": "73208072",
				"thumb": "http://i.vimeocdn.com/video/447236110_100x75.jpg",
				"title": "Jeff Haynie - tiConf AU Keynote 2013",
				"description": "Watch the keynote from tiConf AU 2013 given by Jeff Haynie, CEO of Appcelerator."
			}
		],
		"title": "tiConf AU 2013"
	}, {
		"items": [
			{
				"id": "64215580",
				"thumb": "http://i.vimeocdn.com/video/434775038_100x75.jpg",
				"title": "Trevor Ward: Keeping Within The Box",
				"description": "Follow along with Trevor as he presents a guide of how to develop applications using Titanium, without having to hack, break or use modules. Keeping within the confines of the framework and applying good coding and open source libraries to resolve almost all development issues."
			}, {
				"id": "64214448",
				"thumb": "http://i.vimeocdn.com/video/434772823_100x75.jpg",
				"title": "Samuel Mueller: USING A BARCODE SCANNER TO EXPAND YOUR APP",
				"description": "This session will explain how and when you can easily expand your app with barcode scanning capabilities. After an overview of the technical challenges involved in recognizing barcode images on mobile devices, we will present case studies to illustrate how Scandit's popular barcode scanner module for Titanium empowers new consumer use cases and democratizes established enterprise processes. The session will end with a step-by-step guide on how to integrate the Scandit Module in your app."
			}, {
				"id": "64214359",
				"thumb": "http://i.vimeocdn.com/video/434773629_100x75.jpg",
				"title": "Dan Tamas - Durable and Performant Apps",
				"description": "Dan will give you the lowdown on the best tips on how to speedup applications. During the session he'll explain coding best practices, alternative solutions for well known issues and even UI/UX tricks. He'll also touch on memory management (a sensitive subject in Titanium)."
			}, {
				"id": "64079567",
				"thumb": "http://i.vimeocdn.com/video/434597296_100x75.jpg",
				"title": "Pablo Carballude: Building Windows 8 Native Apps Using JavaScript",
				"description": "Follow us on online!<br />\r\n==========================<br />\r\nWWW at ticonf.eu <br />\r\nTwitter at twitter.com/ticonf<br />\r\nFacebook at facebook.com/groups/436804209711461"
			}, {
				"id": "64079566",
				"thumb": "http://i.vimeocdn.com/video/434600900_100x75.jpg",
				"title": "Pablo Carballude: Interfacing with Azure Web Services",
				"description": "Follow us on online!<br />\r\n==========================<br />\r\nWWW at ticonf.eu <br />\r\nTwitter at twitter.com/ticonf<br />\r\nFacebook at facebook.com/groups/436804209711461"
			}, {
				"id": "64073374",
				"thumb": "http://i.vimeocdn.com/video/434584150_100x75.jpg",
				"title": "Boydlee Pollentine: REST Easy with Deployd",
				"description": "Deployd is an open source platform, built on Node.JS and MongoDB, that allows you to create custom JSON API's in minutes, not days. In this brief talk, Boydlee will explain what the Deployd platform is and show you how it really is the simplest way to design, build and a mobile API.<br />\n<br />\nFollow us on online!<br />\n==========================<br />\nWWW at ticonf.eu <br />\nTwitter at twitter.com/ticonf<br />\nFacebook at facebook.com/groups/436804209711461"
			}, {
				"id": "64072923",
				"thumb": "http://i.vimeocdn.com/video/434583063_100x75.jpg",
				"title": "Toshihide Takechi: DENSO's Mobile Apps for Vehicles",
				"description": "Follow us on online!<br />\r\n==========================<br />\r\nWWW at ticonf.eu <br />\r\nTwitter at twitter.com/ticonf<br />\r\nFacebook at facebook.com/groups/436804209711461"
			}, {
				"id": "64072920",
				"thumb": "http://i.vimeocdn.com/video/434582602_100x75.jpg",
				"title": "Xavier Lacot: Better Faster Stronger - How Alloy daftpunks Your Titanium Projects",
				"description": "This presentation is a general introduction to Alloy, the new MVC-oriented framework created by the Appcelerator guys, which is a sort of great revolution in the Titanium developement world. Alloy greatly improves the way Titanium mobile applications are built: backbone as a model management layer, MVC approach, XML templating, widgets for reusability - real candies for javascript lovers.<br />\r\n<br />\r\nThe attendees will learn how to easily use alloy, and will discover how this new solution brings more structure, productivity and quality to Titanium developements.<br />\r\n<br />\r\nFollow us on online!<br />\r\n==========================<br />\r\nWWW at ticonf.eu <br />\r\nTwitter at twitter.com/ticonf<br />\r\nFacebook at facebook.com/groups/436804209711461"
			}, {
				"id": "64064663",
				"thumb": "http://i.vimeocdn.com/video/434563468_100x75.jpg",
				"title": "Roberto Gil del Sol: Building Apps with Appcelerator & CoffeeScript",
				"description": "Follow us on online!<br />\n==========================<br />\nWWW at ticonf.eu <br />\nTwitter at twitter.com/ticonf<br />\nFacebook at facebook.com/groups/436804209711461"
			}, {
				"id": "63954410",
				"thumb": "http://i.vimeocdn.com/video/434417126_100x75.jpg",
				"title": "Olivier Morandi: Extending Titanium Functionality With Native Modules for iOS & Android",
				"description": "Follow us on online!<br />\n==========================<br />\nWWW at ticonf.eu <br />\nTwitter at twitter.com/ticonf<br />\nFacebook at facebook.com/groups/436804209711461"
			}, {
				"id": "63887961",
				"thumb": "http://i.vimeocdn.com/video/434326720_100x75.jpg",
				"title": "Liz Myers & Luca Sale: Learn How To create BB10 Mobile Apps Using Existing HTML skills & Blackberry WebWorks",
				"description": "Get two for one in this workshop focused on the User-Centred Design process in general and BlackBerry App World in particular. In Part I participants will learn the new UX/UI conventions and best practice for BB10 - the new OS built on QNX. You’ll receive design templates, icon libraries and step-by-step instruction using the same design and build process Liz uses to create polished apps across all platforms.<br />\n<br />\n In Part II - participants will learn how to define a new app for BB10, mockup their idea using Adobe FireWorks, sign up as a BlackBerry App World vendor, get signing keys and debug tokens, build, test, debug, and deploy their app for BB10. If you want to further your app design skills and get started publishing for App World come join us for this action-packed workshop!<br />\n<br />\nFollow us on online!<br/>\n==========================<br />\nWWW at ticonf.eu <br />\nTwitter at twitter.com/ticonf<br/>\nFacebook at facebook.com/groups/436804209711461"
			}, {
				"id": "63885998",
				"thumb": "http://i.vimeocdn.com/video/434321423_100x75.jpg",
				"title": "Joe Maffia: SQLite - Dynamic Data in Titanium & a Primer on JSONDB",
				"description": "SQLite - Dynamic Data in Titanium & a Primer on JSONDB<br />\n<br />\nFollow us on online!<br />\n==========================<br />\nWWW at ticonf.eu <br />\nTwitter at twitter.com/ticonf<br />\nFacebook at facebook.com/groups/436804209711461"
			}, {
				"id": "63861686",
				"thumb": "http://i.vimeocdn.com/video/434289136_100x75.jpg",
				"title": "Ivan Skugor: Object Oriented Structures & Practices",
				"description": "Follow us on online!<br />\n==========================<br />\nWWW at ticonf.eu <br />\nTwitter at twitter.com/ticonf<br />\nFacebook at facebook.com/groups/436804209711461"
			}, {
				"id": "63826539",
				"thumb": "http://i.vimeocdn.com/video/434245986_100x75.jpg",
				"title": "Grant Smith: Introducing Visual-IDE",
				"description": "Follow us on online!<br />\n==========================<br />\nWWW at ticonf.eu <br />\nTwitter at twitter.com/ticonf<br />\nFacebook at facebook.com/groups/436804209711461"
			}, {
				"id": "63818125",
				"thumb": "http://i.vimeocdn.com/video/434229121_100x75.jpg",
				"title": "Esteban Briones",
				"description": ""
			}, {
				"id": "60852842",
				"thumb": "http://i.vimeocdn.com/video/422557095_100x75.jpg",
				"title": "Fireworks in Valencia - from Day 2, during Lunch.",
				"description": "Video shot and generously donated by Fokke Zandbergen (@FokkeZB)<br />\r\n<br />\r\n<br />\r\n<br />\r\nDon't forget that tiConf US is coming to Baltimore, MD from the 28-29th of June, 2013. <br />\r\nTickets are on sale now. Use promo code \"RAVENS\" to get $49 off.   http://2013.ticonf.us<br />\r\n<br />\r\nFollow us on online!<br />\r\n==========================<br />\r\nWWW at ticonf.eu <br />\r\nTwitter at twitter.com/ticonf<br />\r\nFacebook at facebook.com/groups/436804209711461"
			}, {
				"id": "63810204",
				"thumb": "http://i.vimeocdn.com/video/434218190_100x75.jpg",
				"title": "Antonio Calanducci",
				"description": "In this talk, we present an overview of the approaches to implement realtime apps over HTTP and introduce the benefit of WebSockets. Later we introduce Node.ACS and Socket.IO to demonstrate how we built a realtime survey system that works on iOS, Android and HTML5 browsers with Titanium.<br />\r\nThere is a demo that could involve the audience if they will have internet connectivity. The android client could be download here: http://bit.ly/ticonf and the HTML5 client here: http://etnatraining.it/ticonf-demo<br />\r\n<br />\r\n<br />\r\nFollow us on online!<br />\r\n==========================<br />\r\nWWW at http://ticonf.eu <br />\r\nTwitter at http://twitter.com/ticonf<br />\r\nFacebook at http://facebook.com/groups/436804209711461"
			}, {
				"id": "63806296",
				"thumb": "http://i.vimeocdn.com/video/434211144_100x75.jpg",
				"title": "Alessio Ricco: Implementing the BEINTOO Gamification Platform in Titanium",
				"description": "Alessio will show you to implement the BEINTOO gamification platform in a Titanium mobile app using a CommonJS module implementing REST calls.<br />\n<br />\nFollow us on online!<br />\n==========================<br />\nWWW at ticonf.eu <br />\nTwitter at twitter.com/ticonf<br />\nFacebook at facebook.com/groups/436804209711461"
			}, {
				"id": "63310620",
				"thumb": "http://i.vimeocdn.com/video/433520614_100x75.jpg",
				"title": "Ketan Majmudar: CONTROLLING THE CLOUD: PUSH NOTIFICATION WITH ACS",
				"description": "Ketan will run through the anatomy of the Push notice, how it works from device, to the server, to the device. He will also show you how to implement this through an open source project to register tokens, subscribe and send/receive push notifications.<br />\r\n<br />\r\n@Ketan's ACS Push Notification Library - Channel Unsubscribe method now included with callback & error handling support: https://github.com/stereoket/ti-acs-push<br />\r\n<br />\r\nFollow us on online!<br />\r\n==========================<br />\r\nWWW at ticonf.eu <br />\r\nTwitter at twitter.com/ticonf<br />\r\nFacebook at facebook.com/groups/436804209711461"
			}, {
				"id": "62611282",
				"thumb": "http://i.vimeocdn.com/video/432648270_100x75.jpg",
				"title": "Jeff Haynie - Keynote Opening Speech at tiConf EU 2013",
				"description": "Jeff Haynie, CEO of Appcelerator, opens tiConf EU 2013<br />\r\n<br />\r\nDon't forget that tiConf US is coming to Baltimore, MD from the 28-29th of June, 2013. <br />\r\nTickets are on sale now. Use promo code \"RAVENS\" to get $49 off.   http://2013.ticonf.us<br />\r\n<br />\r\nFollow us on online!<br />\r\n==========================<br />\r\nWWW at ticonf.eu <br />\r\nTwitter at twitter.com/ticonf<br />\r\nFacebook at facebook.com/groups/436804209711461"
			}, {
				"id": "62600916",
				"thumb": "http://i.vimeocdn.com/video/432547923_100x75.jpg",
				"title": "Trevor Ward: Deep Dive Into CommonJS patterns and Usage   ( tiConf EU 2013 )",
				"description": "In this video Trevor (@thewarpedcoder) presents a thorough deep dive into CommonJS patterns and usage, explaining some key concepts from the new Appcelerator Titanium Patterns & Practices book.<br />\r\n<br />\r\nhttp://www.amazon.co.uk/Appcelerator-Titanium-Patterns-Best-Practices/dp/184969348X/ref=cm_cr_pr_product_top<br />\r\n<br />\r\n<br />\r\nDon't forget that tiConf US is coming to Baltimore, MD from the 28-29th of June, 2013. <br />\r\nTickets are on sale now. Use promo code \"RAVENS\" to get $49 off.   http://2013.ticonf.us<br />\r\n<br />\r\nFollow us on online!<br />\r\n==========================<br />\r\nWWW at ticonf.eu <br />\r\nTwitter at twitter.com/ticonf<br />\r\nFacebook at facebook.com/groups/436804209711461"
			}, {
				"id": "60817837",
				"thumb": "http://i.vimeocdn.com/video/422282356_100x75.jpg",
				"title": "tiConf EU - Sponsors Rotation Video",
				"description": "Thank you again to all the sponsors listed who helped support tiConf EU 2013. We couldn't do it without you!"
			}, {
				"id": "60817014",
				"thumb": "http://i.vimeocdn.com/video/422277113_100x75.jpg",
				"title": "tiConf EU 2013 - The Introduction Video",
				"description": "Missed the intro video that ran just before we started tiConf 2013?<br />\n<br />\nFret not, you can watch it online and revel in all the bad jokes once more!"
			}
		],
		"title": "tiConf EU 2013 - Valencia"
	}, {
		"items": [
			{
				"id": "70765123",
				"thumb": "http://i.vimeocdn.com/video/444139564_100x75.jpg",
				"title": "Jeff Haynie presents the keynote speech at tiConf US 2013",
				"description": ""
			}, {
				"id": "70038967",
				"thumb": "http://i.vimeocdn.com/video/443166803_100x75.jpg",
				"title": "tiConf US KEYNOTE - Ed Schmit; Executive Director of the AT&T Developer Program",
				"description": "Ed Schmit from ATT&T Developer Program ."
			}, {
				"id": "69986422",
				"thumb": "http://i.vimeocdn.com/video/443028859_100x75.jpg",
				"title": "Alex Chatterjee - MOBILE APPLICATION FOR ENTERPRISES: ANOTHER CUP OF TEA",
				"description": "In this session you'll learn: <br />\n<br />\nDifferences in licensing between enterprise and normal license,<br />\nSecurity in those application (UDID + software defense),<br />\nNetwork security + hanheld security (how to encrypt your data on device in order not to be extracted + how to transfer your data in order not to be compromised),<br />\nOnce everything is set up, how to distribute in a closed environment (how to build your own app store via web and directly on devices), <br />\nthe use of MDM to ease the process."
			}, {
				"id": "69841474",
				"thumb": "http://i.vimeocdn.com/video/442806810_100x75.jpg",
				"title": "Matt Schmulen of Strongloop - Data or Die! Using Node.js to Connect to Mobile Data, Wherever It Is",
				"description": "Mobile platform junkie who has never met a crowd he did not want to talk in front of or an API he didn't want to try.  Matt's #1 goal in life is to rid the world of the slow and crufty mobile middle ware that makes developers wince, companies cry and their uses drop them.  Because of this Node.js is the mobile developers new best friend, and he would like to show you why."
			}, {
				"id": "69841473",
				"thumb": "http://i.vimeocdn.com/video/442807514_100x75.jpg",
				"title": "Jason Kneen - An Introduction to URL Schemes",
				"description": "In this session we'll be looking at URL Schemes on iOS and Android and how they can be used to detect and launch apps, share data between apps, intercept web links, provide cross-app authentication and cross-promote between your own apps."
			}, {
				"id": "69841472",
				"thumb": "http://i.vimeocdn.com/video/442807086_100x75.jpg",
				"title": "Braden Powers - ALLOY + BACKBONE.JS = AWESOME",
				"description": "So you are using Alloy now and you are having some success with it. Now comes the tricky part of using a SQLite database. You know what you use? Backbone.js! Come to this session on how to use Backbone in your alloy app to make it more efficient and to save you time."
			}, {
				"id": "69811273",
				"thumb": "http://i.vimeocdn.com/video/442763372_100x75.jpg",
				"title": "Tony Lukasvage - Alloy. Deep Dive, Below the Surface & Other Nautical Metaphors",
				"description": "In this session, Tony Lukasavage (Lead Engineer on Titanium Alloy) will go through some of the more advanced features and tips of building Alloy applications."
			}, {
				"id": "69797443",
				"thumb": "http://i.vimeocdn.com/video/442735160_100x75.jpg",
				"title": "David Pratt - REINVENTING NATIVE APP DEVELOPMENT FOR MULTIPLE PLATFORMS",
				"description": "Today, apps are expected to be ubiquitous.<br />\r\n<br />\r\nDo you remember receiving a message from one of your want-to-be-consumers asking when you will ever be on this platform or that? – Being everywhere your consumers expect you to be is challenging. While existing tools offer some help, recent innovation is making this easier.<br />\r\n<br />\r\n====================================================================<br />\r\nNotes: Sorry for the minor hiss throughout the first couple of minutes of this video! I have <br />\r\ntried to reduce it to be as unobtrusive as possible. ~ Boydlee<br />\r\n====================================================================<br />\r\n<br />\r\nAs expectations increase and app markets mature, pressure is mounting to increase quality, improve access to your consumers, monetize everywhere, decrease time to market and lower development cost. More than ever, it is important for app developers to capitalize on technology that can deliver on these goals.<br />\r\n<br />\r\nDavid Pratt is the Project Lead for TideSDK as well as a Co-Founder and CEO of CoastalForge Inc. While open source TideSDK is for desktop, David will also introduce new technology that aims to eliminate the pain of developing for multiple platforms (that is relevant to all developers)."
			}, {
				"id": "69378669",
				"thumb": "http://i.vimeocdn.com/video/442118542_100x75.jpg",
				"title": "tiConf US - Sponsors loop",
				"description": ""
			}, {
				"id": "69378668",
				"thumb": "http://i.vimeocdn.com/video/442119771_100x75.jpg",
				"title": "tiConf US 2013 - Intro Video",
				"description": "This short, 10 minute video is a brief history on the mobile phone and tech over the last 50 years and the introduction for this years tiConf US!"
			}, {
				"id": "61515197",
				"thumb": "http://i.vimeocdn.com/video/427934959_100x75.jpg",
				"title": "BOB SIMS: Cross-Platform Titanium Apps & Drupal Web Services",
				"description": "NATO's Joint Force Training Centre (JFTC) is developing a cross-platform mobile application to enable training participant registration for exercise events, conferences, or courses using a mobile device.  This mobile app interacts with the organization's existing Drupal-based event registration website (events.jftc.nato.int) securely and dynamically through authenticated RESTful JSON data exchanges over the network using the Services<br />\r\nmodule.  <br />\r\n<br />\r\nThis information allows the Centre's logistics support staff to view participant's registration signups and adjust to any changes in real-time.  The presentation will include a practical demonstration.<br />\r\n<br />\r\n<br />\r\nDon't forget that tiConf US is coming to Baltimore, MD from the 28-29th of June, 2013. <br />\r\nTickets are on sale now. Use promo code \"RAVENS\" to get $49 off.   http://2013.ticonf.us<br />\r\n<br />\r\nFollow us on online!<br />\r\n==========================<br />\r\nWWW at ticonf.eu <br />\r\nTwitter at twitter.com/ticonf<br />\r\nFacebook at facebook.com/groups/436804209711461"
			}, {
				"id": "61268775",
				"thumb": "http://i.vimeocdn.com/video/426244176_100x75.jpg",
				"title": "Grant Shipley - Keynote Speech, Day 2",
				"description": "Grant Shipley from Open Shift presents.<br />\r\n<br />\r\n<br />\r\nDon't forget that tiConf US is coming to Baltimore, MD from the 28-29th of June, 2013. <br />\r\nTickets are on sale now. Use promo code \"RAVENS\" to get $49 off.   http://2013.ticonf.us<br />\r\n<br />\r\nFollow us on online!<br />\r\n==========================<br />\r\nWWW at ticonf.eu <br />\r\nTwitter at twitter.com/ticonf<br />\r\nFacebook at facebook.com/groups/436804209711461"
			}, {
				"id": "61268773",
				"thumb": "http://i.vimeocdn.com/video/426236561_100x75.jpg",
				"title": "Javier Rayón : ACS + TITANIUM: LET'S CONQUER THE WORLD!",
				"description": "Day 2 - For any mobile developer, Titanium is a great advantage compared to native development. But there is still a high dependency on backend development, integration with servers, remote databases and so on. ACS (Appcelerator Cloud Services) reduces a lot all these extra developments that use to be far away from what is considered mobile development, and simplifying projects related to social networks, databases, geo-location… well, almost everything.<br />\r\nIn this 45 minutes class Javier will show how to start coding ACS with Titanium in real projects, introducing some tips and good practices done from his experience to work with users, notifications, geo-location, database objects and so on and keep code clean and safe.<br />\r\n<br />\r\nAttendees are encouraged to have a look to the ACS API http://cloud.appcelerator.com/docs/api/v1/acls/create<br />\r\n<br />\r\n<br />\r\nDon't forget that tiConf US is coming to Baltimore, MD from the 28-29th of June, 2013. <br />\r\nTickets are on sale now. Use promo code \"RAVENS\" to get $49 off.   http://2013.ticonf.us<br />\r\n<br />\r\nFollow us on online!<br />\r\n==========================<br />\r\nWWW at ticonf.eu <br />\r\nTwitter at twitter.com/ticonf<br />\r\nFacebook at facebook.com/groups/436804209711461"
			}, {
				"id": "61109189",
				"thumb": "http://i.vimeocdn.com/video/424722688_100x75.jpg",
				"title": "MARCUS ROSS  -  CROSS PLATFORM COPTER, CONTROLLING HARDWARE WITH TITANIUM",
				"description": "Watch as Marcus Ross presents the CrossPlatformCopter, during this session about using Titanium with hardware. You control the ar.drone from Parrot with JavaScript and Titanium. All done with Titanium and truly cross platform, running on Blackberry 10, iOS and Android. You will learn on this sessions the difference of hardware programming in comparison to a business app.<br />\r\n<br />\r\n<br />\r\nDon't forget that tiConf US is coming to Baltimore, MD from the 28-29th of June, 2013. <br />\r\nTickets are on sale now. Use promo code \"RAVENS\" to get $49 off.   http://2013.ticonf.us<br />\r\n<br />\r\nFollow us on online!<br />\r\n==========================<br />\r\nWWW at ticonf.eu <br />\r\nTwitter at twitter.com/ticonf<br />\r\nFacebook at facebook.com/groups/436804209711461"
			}
		],
		"title": "tiConf US 2013 - Baltimore"
	}, {
		"items": [
			{
				"id": "52697965",
				"thumb": "http://b.vimeocdn.com/ts/363/681/363681084_100.jpg",
				"description": "Michael King, Appcelerator's Director of Enterprise Services, discusses the following:<br />\r\n<br />\r\n- Deep dive on the technologies involved in building a “mobile-first” organization<br />\r\n- Next-generation mobility platforms, mobile application, mobile device management, and a host of other technologies exist to help enterprises mobilize employee apps and everything customer facing.<br />\r\n- How do you choose them, what are the requirements, and in what should you expect them to do.",
				"title": "Enterprise Summit - Technologies to Enable Mobile First Enterprises"
			}, {
				"id": "52692323",
				"thumb": "http://b.vimeocdn.com/ts/363/644/363644049_100.jpg",
				"description": "Michael King, Appcelerator's Director of Enterprise Services, discusses the following:<br />\r\n<br />\r\n- What is a mobile strategy and how do you implement one?<br />\r\n- Learn from Appcelerator's resident experts, and their experience helping companies like yourselves build a long-term sustainable mobile strategy.<br />\r\n- What is a mobile center of excellence and how do you build one?<br />\r\n- Learn about organizational structures, and better ways that IT and the line of business can work together to chart a mobile future.",
				"title": "Enterprise Summit - Creating a Mobile Strategy"
			}, {
				"id": "52669398",
				"thumb": "http://b.vimeocdn.com/ts/363/488/363488291_100.jpg",
				"description": "Appcelerator customers discuss how to create great mobile apps for customers and the mobile workforce.<br />\r\n<br />\r\n- David Hosted, Director of Web and Mobile Services, University of Wisconsin/Milwaukee<br />\r\n- Mas Kono, Director of IT, GameStop<br />\r\n- George Mehok, Chief Information Officer, Safeguard Properties<br />\r\n- Gabriel Weiss, Interactive Marketing Technologies, Mitsubishi<br />\r\n- Moderator: Lyla McInerney, VP of Marketing, Appcelerator",
				"title": "Keynote Panel - Secrets for Developing for the Enterprise"
			}, {
				"id": "52669397",
				"thumb": "http://b.vimeocdn.com/ts/363/475/363475308_100.jpg",
				"description": "Jeremia Kimelman, Devangelist for Tout<br />\r\n<br />\r\nSo you built an app – awesome! That's an achievement itself. But we're willing to guess you aren't just looking to have a mobile app in the store for the sake of seeing your name on iTunes or Google Play. We'll bet you're more interested in developing a mobile business than an app. Join us to learn:<br />\r\n <br />\r\n- What are your mobile monetization options?<br />\r\n- How much, if anything, can you afford to acquire customers?<br />\r\n- How do you optimize your presence in the App Store?<br />\r\n- How do we make sure that your landing page drives conversions?<br />\r\n- What about after the download … how do you keep a customer engaged?",
				"title": "Keynote - How to Build a Top Ten App"
			}, {
				"id": "52667037",
				"thumb": "http://b.vimeocdn.com/ts/363/451/363451563_100.jpg",
				"description": "",
				"title": "Keynote - Jonathan Rende, Appcelerator's VP of Products"
			}, {
				"id": "52661030",
				"thumb": "http://b.vimeocdn.com/ts/363/418/363418355_100.jpg",
				"description": "Dion Almaer, VP Mobile Architecture and Ben Galbraith, VP Mobile Engineering, Walmart<br />\r\n <br />\r\nApple's iPhone SDK has proven the largest disruption to software development since the Web, sparking the creation in a few short years of the largest medium for consumer engagement in the world, eclipsing even movies and television. The Web, once destined to be the industry's dominant app platform, now has an uncertain future in mobile at a time when mobile is disrupting the entire PC industry. Is the Web destined to reclaim its former glory, or will app popularity continue its explosive growth? Join Ben and Dion as they discuss the web vs. app conflict in the context of the present and the post-PC era beyond.",
				"title": "Keynote - Dion Almaer and Ben Galbraith: Web vs. Apps"
			}, {
				"id": "52654245",
				"thumb": "http://b.vimeocdn.com/ts/363/381/363381942_100.jpg",
				"description": "",
				"title": "Keynote - Jeff Haynie, Appcelerator's CEO"
			}, {
				"id": "52638428",
				"thumb": "http://b.vimeocdn.com/ts/363/274/363274659_100.jpg",
				"description": "",
				"title": "Keynote - Nolan Wright, Appcelerator's CTO"
			}, {
				"id": "52190964",
				"thumb": "http://b.vimeocdn.com/ts/360/022/360022028_100.jpg",
				"description": "",
				"title": "CODESTRONG Conference Close"
			}, {
				"id": "52190962",
				"thumb": "http://b.vimeocdn.com/ts/360/025/360025144_100.jpg",
				"description": "David Bankier, Director, YY Digital<br />\r\n <br />\r\nThis session demonstrates how to do \"live\" testing against either the simulator or device - and on iOS or Android - simultaneously. Using a BDD framework also makes this easy.<br />\r\n<br />\r\n1) There is much much more to Titanium than apps, modules and the cloud - its great fun and highly rewarding.<br />\r\n2) Anything that annoys you fix it yourself.<br />\r\n3) There are no limits - it is much easier than you think.",
				"title": "Breakout - Hacking Titanium"
			}, {
				"id": "52826174",
				"thumb": "http://b.vimeocdn.com/ts/364/585/364585301_100.jpg",
				"description": "Rob Rusher, Principal Consultant, On3 Solutions<br />\r\n <br />\r\nThere is a huge difference between imagining and seeing. There is a bigger difference between developers who plan and those who plan to fail. That difference is a Prototype. Unfortunately, building prototypes takes time and money you don't have. That is, until you attend this session in which we will demonstrate the tools and processes we use at On3. In minutes, we build prototypes that are easily installed on a device for a realistic experience that wins hearts and closes deals. Show, don't imagine. Plan, don't guess. Being a professional doesn't happen by accident.",
				"title": "Breakout session - Create Real Interactive Prototypes in Minutes"
			}, {
				"id": "52826173",
				"thumb": "http://b.vimeocdn.com/ts/364/584/364584913_100.jpg",
				"description": "Carl Orthlieb/Ingo Muschenetz<br />\r\n <br />\r\nLearn about the new features released in 3.0 including ACS custom cloud services, new mobile platforms, and the latest in on device debugging.",
				"title": "Breakout session  - What's new in Titanium Studio"
			}, {
				"id": "52813039",
				"thumb": "http://b.vimeocdn.com/ts/364/500/364500925_100.jpg",
				"description": "Wei Kong, Director of Cloud Services<br />\r\n <br />\r\nWant to go to the cloud but don't know how to get there? Learn about the 15 cloud services that will make your app shine.<br />\r\nDebugging your cloud enabled application: common pitfalls and tips for integrating your mobile app with ACS.<br />\r\nCreating custom cloud services: the ultimate in integration, mash ups, and new functionality. Do you know JS? Then you can create your own services quickly and deploy them easily.",
				"title": "Breakout session - Building Your Own Custom Cloud Services"
			}, {
				"id": "52813038",
				"thumb": "http://b.vimeocdn.com/ts/364/503/364503528_100.jpg",
				"description": "Mike Goff, Director of Product Management, Appcelerator<br />\r\n <br />\r\nAs a mobile developer, you've already adopted the 20+ prebuilt Appcelerator cloud services (ACS) so you can easily build the back end of your mobile app using Titanium, or for your native apps with a single line of javascript<br />\r\nThis session will show you everything you need to know to build your own custom cloud based services for ACS, including best -practices and different deployment options<br />\r\nWe'll walk through simple examples of how you can create your own cloud based services to integrate social and video to enhance your online mobile experience",
				"title": "Breakout session - Using Appcelerator Cloud Services in Your Apps"
			}, {
				"id": "52802376",
				"thumb": "http://b.vimeocdn.com/ts/364/456/364456643_100.jpg",
				"description": "Carlos Icaza, Founder, Lanica<br />\r\n <br />\r\nLearn about Platino™ the new game engine by Lanica and learn how to quickly produce games using standard gaming techniques such as SpriteSheets, Parallax Scrolling, Particle Effects and others.<br />\r\n <br />\r\nWe will also cover some of the advance rendering techniques that will be available in Platino such as Shaders, Vertices Arrays, Parallax Mapping, Physics, and more.",
				"title": "Breakout session - Rapid Game Development on Titanium"
			}, {
				"id": "52776791",
				"thumb": "http://b.vimeocdn.com/ts/364/242/364242381_100.jpg",
				"description": "Joe Shrirey, Microsoft",
				"title": "Breakout  session - New Device Platform support for Titanium"
			}, {
				"id": "52802373",
				"thumb": "http://b.vimeocdn.com/ts/364/474/364474014_100.jpg",
				"description": "Grant Shipley, Manager of Cloud Evangelist, Red Hat<br />\r\n <br />\r\nJoin us for a technical how-to session on how to develop iPhone and Android apps with MongoDB backends for the cloud. Let's skip having to learn three different languages and jumpstart the development process using what you already know. We'll utilize Appcelerator's Titanium IDE to create a native mobile application targeting multiple mobile platforms. Next, we'll deploy our app to the cloud and explore a few tips and tricks for managing the MongoDB backend. Finally we'll pull out our smartphones and bask in the awesomeness of our apps! Nothing complicated, nothing convoluted. Just straight ahead mobile development goodness with MongoDB.",
				"title": "Breakout session - Developing iPhone and Android Apps using Titanium and Red Hat's OpenShift"
			}, {
				"id": "52802374",
				"thumb": "http://b.vimeocdn.com/ts/364/464/364464376_100.jpg",
				"description": "Michael King, Director of Enterprise Strategy, Appcelerator<br />\r\n <br />\r\nDive deep, on the mobile application lifecycle.<br />\r\nUnderstand all the roles involved in today's mobile application lifecycle. From plan to build to test to manage to analyze… And beyond<br />\r\nUnderstand how testing can affect every aspect of your application will reprocess and see a demo of some of the latest testing capabilities from our partners<br />\r\nRole-based, lifecycle management is the future of mobile application development, come get a preview of what it looks like",
				"title": "Breakout session - Leveraging Titanium as Part of Your Mobile App Lifecycle"
			}, {
				"id": "52802375",
				"thumb": "http://b.vimeocdn.com/ts/364/446/364446883_100.jpg",
				"description": "Kevin Whinnery, Technical Evangelist, Appcelerator<br />\r\n <br />\r\nIn this session, developers will learn practical techniques for test automation in Titanium Mobile applications. We will explore the challenges of rich client testing generally before diving into examples of how to write tests for a Titanium app. Finally, we will explore the next frontier of rich client testing which combines unit-level testing with functional test automation, capturing and testing real user interactions.",
				"title": "Breakout session - Testing Best Practices: Unit and Functional Automation"
			}, {
				"id": "52776789",
				"thumb": "http://b.vimeocdn.com/ts/364/241/364241234_100.jpg",
				"description": "Blain Hamon, Senior Software Engineer, Appcelerator<br />\r\n <br />\r\nThis session will delve into the history, structure, and inner workings of Titanium for iPhone in order to provide an understanding of how it does what it does, and how to best make your app responsive, efficient, and fast. Also a demo on debugging on Titanium for iPhone, and some caveats involved.",
				"title": "Breakout session - iOS Internals and Best Practices"
			}, {
				"id": "52772953",
				"thumb": "http://b.vimeocdn.com/ts/364/211/364211867_100.jpg",
				"description": "Simon Berman, Sr. Director Product Marketing, Appcelerator<br />\r\n <br />\r\nBuilding the back end server side functions to a mobile application can cost 2 - 3 times the time and money that you spent building the client.<br />\r\nThis session will walk through the business benefits of using a cloud based back-end as a service, including scalability, lowers cost, and lower risk to you the developer<br />\r\nWalk through an actual business case to justify using pre-built cloud services with any mobile application for your client",
				"title": "Breakout - The Role of Cloud Services in Your Next Gen Mobile Apps"
			}, {
				"id": "52771295",
				"thumb": "http://b.vimeocdn.com/ts/364/196/364196895_100.jpg",
				"description": "Pratik Patel, CTO, TripLingo<br />\n <br />\nThis session demonstrates how to do \"live\" testing against either the simulator or device - and on iOS or Android - simultaneously. Using a BDD framework also makes this easy.<br />\n <br />\n1) Running Jasmine tests for Titanium Projects<br />\n2) Running BDD tests for both the simulator and device<br />\n3) UI & non-UI code testing strategies",
				"title": "Breakout session - Live Multi-Platform Testing"
			}, {
				"id": "52765326",
				"thumb": "http://b.vimeocdn.com/ts/364/173/364173920_100.jpg",
				"description": "Aaron Saunders, CTO, Clearly Innovative<br />\r\n <br />\r\nSee how easy it is to extend the Titanium platform! In this session, you will learn how to set up your environment and run scripts through Titanium Studio. We will then walk through several real-live Titanium modules on iOS and Android.",
				"title": "Breakout session - How to Develop Your Own Modules"
			}, {
				"id": "52734104",
				"thumb": "http://b.vimeocdn.com/ts/363/958/363958440_100.jpg",
				"description": "Dennis Ashby, Director of Professional Services, Appcelerator<br />\r\n <br />\r\nLearn how to market to, sell to and deliver mobile application projects to enterprise clients<br />\r\nUnderstand what are the right ways to position and deliver UI and Mobile first application designs to biz focused clients<br />\r\nGet involved in your clients mobile application lifecycle, and build and grow a long, lucrative relationship with your enterprise clients",
				"title": "Breakout session - How to Win Bigger Mobile Deals"
			}, {
				"id": "52765327",
				"thumb": "http://b.vimeocdn.com/ts/364/180/364180149_100.jpg",
				"description": "David Bankier, Director, YY Digital<br />\r\n <br />\r\nThis session demonstrates how to do \"live\" testing against either the simulator or device - and on iOS or Android - simultaneously. Using a BDD framework also makes this easy.<br />\r\n<br />\r\n1) There is much much more to Titanium then apps, modules and the cloud - its great fun and highly rewarding.<br />\r\n2) Anything that annoys you fix it yourself.<br />\r\n3) There are no limits - it is much easier than you think.",
				"title": "Breakout session - Hacking Titanium"
			}, {
				"id": "52734105",
				"thumb": "http://b.vimeocdn.com/ts/363/967/363967039_100.jpg",
				"description": "Josh Roesslein, Software Engineer, Appcelerator<br />\r\n <br />\r\nLearn about new Android specific features in the 3.0 version of the SDK.<br />\r\nNot all platforms are the same! Discover best practices for getting the most out of your Android apps.<br />\r\nLearn tips for developing your application for Android and key issues to be aware of.<br />\r\nDebugging in Android both in simulator and on device.<br />\r\nCrossing the kroll-bridge: how JS interacts with native Android",
				"title": "Breakout session - Android Internals and Best Practices"
			}, {
				"id": "52734106",
				"thumb": "http://b.vimeocdn.com/ts/363/968/363968425_100.jpg",
				"description": "Fred Spencer is the Sr. UI/UX Architect and Design Lead within the Professional Services group at Appcelerator. Located in Worcester, Massachusetts, he teaches in the Continuing Education department at the Rhode Island School of Design.<br />\r\nSession topics include:<br />\r\n <br />\r\nPractical User Experience and Interaction Design<br />\r\nDesign Vision: Bridging the Memory & Comprehension Gap<br />\r\nPlatform Equality<br />\r\nUI/UX Case Study Analysis<br />\r\nDesign Tips and Tricks",
				"title": "Breakout session - Designing the Ultimate User Experience"
			}, {
				"id": "52765324",
				"thumb": "http://b.vimeocdn.com/ts/364/185/364185247_100.jpg",
				"description": "Steve Feloney<br />\r\n <br />\r\nThis session will walk through the current process of adding your modules to the marketplace<br />\r\nIt will discuss what you should be considering when building modules and what community exposure you can expect in Appc's Marketplace<br />\r\nLastly, this session will focus on sharing use cases of successful modules that have been developed for the marketplace",
				"title": "Breakout session  - Making Money on Appcelerator's Marketplace"
			}, {
				"id": "52733415",
				"thumb": "http://b.vimeocdn.com/ts/363/930/363930417_100.jpg",
				"description": "Bryan Hughes, PhD, Appcelerator<br />\n <br />\nNot all platforms are the same! Discover best practices for getting the most out of your Mobile Web apps.<br />\nLearn tips for developing your application for Mobile Web and key issues to be aware of.<br />\nDebugging in Mobile Web in the browser.<br />\nPerformance, performance, performance: getting the most out of your Mobile Web applications.",
				"title": "Breakout session - Introduction to Mobile Web and Best Practices"
			}, {
				"id": "52765325",
				"thumb": "http://b.vimeocdn.com/ts/364/186/364186690_100.jpg",
				"description": "Tony Lukasavage, Sr. Software Engineer, Appcelerator<br />\r\n <br />\r\nModel, View, Controller: understand how a common MVC framework can help you make the best Ti app<br />\r\nHow Alloy reduces the amount of code you have to write<br />\r\nRe-usable widgets: how to leverage code across applications<br />\r\nSecrets of debugging generated code<br />\r\nTips and tricks on Alloy best practices",
				"title": "Breakout session  - Alloy (MVC) Application Framework Overview"
			}, {
				"id": "52734103",
				"thumb": "http://b.vimeocdn.com/ts/363/957/363957083_100.jpg",
				"description": "Chris Barber, Platform Lead, Appcelerator<br />\r\n <br />\r\nTitanium is getting a new Command Line Interface (CLI) that will make it easier to create and build your Titanium apps using the command line. The new CLI will allow you to integrate Titanium into your own development toolchain. Join Chris and learn about all the commands and features that you'll need to know.",
				"title": "Breakout session - Exploring the New Titanium Command Line Interface (CLI)"
			}
		],
		"title": "CODESTRONG 2012"
	}, {
		"items": [
			{
				"description": "Kick off this video learning experience with a 10,000 foot overview of Titanium, explaining high level features and architecture.",
				"thumb": "http://b.vimeocdn.com/ts/304/296/304296355_100.jpg",
				"id": "28822084",
				"title": "Titanium Overview"
			}, {
				"description": "Working with Titanium Mobile requires a working knowledge of the Android and iOS SDKs and the related tooling. Get a crash course on each in this training module.",
				"thumb": "http://b.vimeocdn.com/ts/301/460/301460554_100.jpg",
				"id": "26414617",
				"title": "You're a Native App Developer Now"
			}, {
				"description": "Take a brief tour of Titanium Studio, the Appcelerator IDE for Titanium development.",
				"thumb": "http://b.vimeocdn.com/ts/192/584/192584712_100.jpg",
				"id": "28824081",
				"title": "Titanium Studio"
			}, {
				"description": "Learn the basics of structuring JavaScript code and supporting multiple languages and platforms in your Titanium Mobile application.",
				"thumb": "http://b.vimeocdn.com/ts/301/428/301428222_100.jpg",
				"id": "26414757",
				"title": "Cross-Platform JavaScript Applications"
			}, {
				"description": "Learn the basics of crafting user interfaces in Titanium Mobile",
				"thumb": "http://b.vimeocdn.com/ts/301/409/301409336_100.jpg",
				"id": "26414831",
				"title": "UI Fundamentals"
			}, {
				"description": "Learn to use a local SQL database and the lightweight properties API in this persistence-focused training module.",
				"thumb": "http://b.vimeocdn.com/ts/301/394/301394076_100.jpg",
				"id": "26414892",
				"title": "Working with Local Data"
			}, {
				"description": "Learn to interact with server-side data in this training module.",
				"thumb": "http://b.vimeocdn.com/ts/301/338/301338134_100.jpg",
				"id": "26414909",
				"title": "Working with Remote Data"
			}, {
				"description": "Learn how to work with and store rich media assets and other files in this training module.",
				"thumb": "http://b.vimeocdn.com/ts/301/335/301335120_100.jpg",
				"id": "26414926",
				"title": "Media and the Filesystem"
			}, {
				"description": "Integrate geolocation, maps, and more in this locality-focused training module.",
				"thumb": "http://b.vimeocdn.com/ts/301/337/301337152_100.jpg",
				"id": "26415137",
				"title": "Using Location Services"
			}, {
				"description": "Master the device address book and integrated Facebook APIs in this training session.",
				"thumb": "http://b.vimeocdn.com/ts/301/281/301281184_100.jpg",
				"id": "26415151",
				"title": "Integrating Contacts & Social Media"
			}, {
				"description": "Master the Titanium WebView in this training module.",
				"thumb": "http://b.vimeocdn.com/ts/301/261/301261482_100.jpg",
				"id": "26415168",
				"title": "Integrating Web Content"
			}, {
				"description": "We'll look at how to install apps to Android and iOS devices for testing. We'll see how to package apps for distribution, including obtaining appropriate certificates and credentials, and how to publish apps to the Android Market and Apple App Store.",
				"thumb": "http://b.vimeocdn.com/ts/301/299/301299139_100.jpg",
				"id": "26415440",
				"title": "Deployment & Distribution"
			}
		],
		"title": "Building Native Mobile Apps"
	}, {
		"items": [
			{
				"description": "The CommonJS module specification is an emerging standard for creating secure, reusable modules in JavaScript applications. Learn how to use it in the first installment of Forging Titanium on Appcelerator.TV",
				"thumb": "http://b.vimeocdn.com/ts/182/252/182252698_100.jpg",
				"id": "27447911",
				"title": "1: CommonJS Modules"
			}, {
				"description": "Developing cross-platform applications in Titanium, one of the challenges facing a developer is maximizing code reuse while still conforming to the UI conventions of the Android or iOS platform. In this week's episode, we explore how we could create a hierarchical Navigation Controller, which would display a series of windows in an easily navigable stack. Be sure to join us next week as well, when further explore how to extend core Titanium UI components to create custom UI controls.",
				"thumb": "http://b.vimeocdn.com/ts/185/156/185156896_100.jpg",
				"id": "27834295",
				"title": "2: A Cross-Platform Navigation Controller"
			}, {
				"description": "In last week's episode, we created a cross-platform Navigation Controller as a custom component we could use to organize windows in a Titanium application. This week, we will be taking a deeper look at how to extend core Titanium objects and create our own custom UI components.<br>In order to accomplish this, we will be using a technique popularized by JavaScript luminary Douglas Crockford, which is called parasitic inheritance. Parasitic inheritance takes advantage of the malleable nature of JavaScript objects, allowing a developer to create an instance of a given type, modify it with additional properties, and return it as a new type of object.<br>This is a very powerful technique in JavaScript applications generally, but is even more useful and powerful when dealing with JavaScript proxy objects in Titanium. We can use factory functions in the Ti.UI namespace to create base UI components, and then extend those components with new features and functionality we define ourselves.<br>Find out how use this technique to create a custom ratings widget in this week's episode of Forging Titanium.",
				"thumb": "http://b.vimeocdn.com/ts/187/337/187337909_100.jpg",
				"id": "28122504",
				"title": "3: Creating Custom Components"
			}, {
				"description": "In Episode 2, we took a look at a framework for displaying a stack of windows in a cross-platform navigation controller. This week, we'll be taking a look at implementing a simple two-stage utility application, while isolating our cross-platform navigation code to a single component.<br> This week we will be building upon our technique of creating custom components, while adding in an important API for creating component-oriented applications: Application-level events. By firing and listening for custom events, we can ensure that components in our system do not need to have knowledge of how other components behave - they just need to know how to indicate to the rest of the application that an important event has happened.<br>Find out how use this technique to create a two-stage utility application in this week's episode of Forging Titanium.",
				"thumb": "http://b.vimeocdn.com/ts/189/620/189620284_100.jpg",
				"id": "28428962",
				"title": "4: A Utility Application Template"
			}, {
				"description": "In this week's episode, we'll be taking a look at Parse, a new service which allows developers to quickly and easily set up persistent back end data services for their application. This is particularly useful for mobile applications that aren't terribly concerned with back end business logic, like games or utility applications.<br>While Parse is still in beta and has a few kinks that need to be worked out, it's definitely a project worth tracking, and is super easy to use in Titanium. Find out how to use a simple Parse client in this week's episode of Forging Titanium.",
				"thumb": "http://b.vimeocdn.com/ts/191/676/191676062_100.jpg",
				"id": "28704163",
				"title": "5: Parse - A Simple Back End for Mobile Applications"
			}, {
				"description": "In this week's episode, we'll be taking a look at how to implement a tab-based application in a single JavaScript context in Titanium Mobile. Throughout our reference guides and official training course, we generally advocate the use of a single JavaScript context in your Titanium applications.<br>However, in our most popular demo application, the Titanium Mobile Kitchen Sink, a tab-based application is developed using multiple contexts by associating each window opened with a URL to a JavaScript file. While this approach is technically valid, it presents the developer with difficulties around sharing data between windows, confusion around when code for a window has been executed, possible object reference issues which can lead to memory leaks, and reloading of JavaScript code in every window for shared libraries. For those reasons, unless you have a specific need for a \"clean slate\" in every window, using multiple JavaScript contexts cannot be considered a best practice approach to structuring a Titanium Mobile application.<br>What then would be a reasonable approach to structuring windows in a tabbed application? And how do we work around the loss of Ti.UI.currentTab and friends? Find out the answer in this week's episode of Forging Titanium.",
				"thumb": "http://b.vimeocdn.com/ts/194/319/194319701_100.jpg",
				"id": "29059611",
				"title": "6: A Single Context Tab Group Template"
			}, {
				"description": "In this week's episode, we'll be taking a look at Twilio, a cloud-based service for adding telephony features to applications through a RESTful web service API. Using Twilio, developers can send and receive phone calls and SMS text messages, enabling the creation of interfaces that pass beyond the reach of smart phones.<br>Learn how to send and receive phone calls and text messages in your mobile applications in this week's episode of Forging Titanium.",
				"thumb": "http://b.vimeocdn.com/ts/197/354/197354612_100.jpg",
				"id": "29459123",
				"title": "7: Titanium and Twilio for Cloud Communications"
			}, {
				"description": "With the new Mac App Store, many Mac OS X developers are taking advantage of the frictionless distribution mechanism of the Mac App Store to distribute and monetize desktop applications. In fact, some top Mac App Store apps have been written and distributed using Titanium! In this multi-part series, we will explore the APIs and techniques necessary to build and distribute an application to the Mac App Store using Titanium Desktop.",
				"thumb": "http://b.vimeocdn.com/ts/199/301/199301606_100.jpg",
				"id": "29730646",
				"title": "8: Mac (App Store) Attack! Part 1"
			}, {
				"description": "In this episode of Forging Titanium we’ll look at our Android Intent Cookbook app which shows us Kitchen Sink-style how we can use Intents for some of the more common mobile development tasks. In addition we’ll do a full walkthrough showing you how to use Intents to add, pick, edit, and view contacts.",
				"thumb": "http://b.vimeocdn.com/ts/201/870/201870189_100.jpg",
				"id": "30085488",
				"title": "9: Android Intent Cookbook"
			}, {
				"description": "In this episode of Forging Titanium we’ll look at how we can use CommonJS patterns to develop a simplified interface for creating cross platform mobile forms. We’ll carefully abstract the underlying functionality of forms and expose only the critical functions and properties necessary to process them via a CommonJS module.",
				"thumb": "http://b.vimeocdn.com/ts/204/058/204058605_100.jpg",
				"id": "30387041",
				"title": "10: Forms"
			}, {
				"description": "As Titanium developers, we are constantly looking for ways to not only increase our ability as mobile developers, but as Javascript developers as well. Wrapping your head around powerful utility libraries like Underscore.js and using them in your own code is one important step in that direction.<br>In this episode of \"Forging Titanium\" will be taking a look at how we can use Underscore.js to quickly handle one of the most common tasks in any app: data normalization. We'll see how our code can be made more concise and expressive through the use of Underscore's many useful functions. In the end we'll have a simple, cross platform, table-driven app whose code is easy to read and maintain.",
				"thumb": "http://b.vimeocdn.com/ts/207/045/207045169_100.jpg",
				"id": "30796377",
				"title": "11: Titanium & Underscore.js"
			}, {
				"description": "To keep the ball rolling on integrating existing Javascript libraries with Titanium, this week's episode shows off the Date.js library in a cross platform mobile app. We'll include this powerful date and time processing library, in a modular manner, to enhance the native Javascript Date object. Ideally, you'll let Date.js do all the grunt work of parsing disparately formatted dates while you spend your valuable time adding much more interesting features to your Titanium apps.",
				"thumb": "http://b.vimeocdn.com/ts/210/296/210296044_100.jpg",
				"id": "31228723",
				"title": "12: Titanium & Date.js"
			}, {
				"description": "In this week’s episode of Forging Titanium we step into the world of Android Status Bar Notifications. With these native notifications, you can more readily keep your users engaged with the current state of your app and its content. When you consider the fact that most mobile app’s sessions can be measured in seconds, that constant engagement becomes a critical component to the ongoing success of your apps. And the best part about it? It’s built right into Titanium’s core Javascript API.",
				"thumb": "http://b.vimeocdn.com/ts/212/435/212435882_100.jpg",
				"id": "31511185",
				"title": "13: Android Notifications"
			}, {
				"description": "This week's episode of Forging Titanium will be part 1 in a 3 part series. In this series we will be creating a fun little experiment called \"Twisti\". In this app we'll be taking on a whole host of advanced Titanium features, as well as leveraging both platform specific and web-based development capabilities. We'll touch on native Android module development, 3D rendering and animation in WebViews, and realtime communication via sockets.<br>Today, though, we'll specifically be covering how to create a native Android module for use in our Titanium apps. This module in particular will be a souped up version of the core `Titanium.Accelerometer` module. We will not only return accelerometer data, but also data regarding the magnetic field of the device so we can determine its physical orientation.<br>If that doesn't sound exciting enough for you, then perhaps you'll want to stick around for the sneak peek at Part 2 at the end. There we'll show you a demo of how this data can be used to render a 3D animated version of your phone right in a Titanium WebView!",
				"thumb": "http://b.vimeocdn.com/ts/215/143/215143008_100.jpg",
				"id": "31868247",
				"title": "14: Twisti Part 1 - Android Module"
			}, {
				"description": "In Part 1 of the Twisti app series we created a native Android module that listened for sensor data. This sensor data was then transformed into 3 values, azimuth, pitch, and roll, which represented the physical orientation of the mobile device.<br>In Part 2 we'll take that transformed data and use it to represent a mobile device as an animated 3D model. This 3D model will be rendered in a element via a Titanium WebView with the help of the open source Javascript 3D engine, Three.js. With this, Twisti is quickly becoming a powerful mix of native functionality and cross platform compatibility.",
				"thumb": "http://b.vimeocdn.com/ts/216/907/216907395_100.jpg",
				"id": "32102962",
				"title": "15: Twisti Part 2 - 3D with Three.js"
			}, {
				"description": "In Part 1 of the Twisti app series we created a native Android module that listened for sensor data. This sensor data was then transformed into 3 values, azimuth, pitch, and roll, which represented the physical orientation of the mobile device. In Part 2 we took that transformed data and used it to represent a mobile device as an animated 3D model with Three.js in a Titanium WebView.<br>In this third and final episode in the series, we'll create a client/server relationship with Titanium Sockets. We'll create an android device that will act as a sensor proxy, serving its physical orientation to connected clients. Those clients will represent the remote sensor as a 3D model, just as in Part 2.",
				"thumb": "http://b.vimeocdn.com/ts/223/485/223485904_100.jpg",
				"id": "32976053",
				"title": "16: Twisti Part 3 - Sockets"
			}, {
				"description": "This week on \"Forging Titanium\" we'll be taking a closer look at the recently announced 1.8.0.1 continuous integration build of the Titanium Mobile SDK. The reason this build is such a hot subject is that it is the first to allow Titanium developers to have access to the V8 Javascript engine as an Android runtime. In short, V8 will potentially bring tremendous performance improvements to your Android apps without any intervention on your part.<br>It's a very exciting time for Titanium Android developers. Don't miss this screencast if you want to join in on the fun!",
				"thumb": "http://b.vimeocdn.com/ts/225/538/225538641_100.jpg",
				"id": "33249107",
				"title": "17: Android, Meet V8"
			}, {
				"description": "This week on \"Forging Titanium\" we're going to take a look at the new features offered in the latest 1.0.7 release of Titanium Studio. Your favorite tool for Titanium development just got a lot more powerful. Here's some highlights from the over 400 new features and fixes:<br>* Dashboard configuration wizard to help download, install, and configure your native iOS and Android SDKs<br>* Supports configuration of both Rhino and V8 as your Android runtime<br>* Debugging is now available for the V8 runtime<br>* Native iOS and Android modules can now be created right in Titanium Studio with the new module creation wizard<br>* Titanium API code snippets are loaded up and ready to be used with just a few key strokes<br>* You can now create your own app templates and samples using Rubles<br>Rather than read this list, why not just check out the screencast and see them all in action? It's a must-view for Titanium developers looking to leverage every bit of power Titanium Studio provides.",
				"thumb": "http://b.vimeocdn.com/ts/228/820/228820136_100.jpg",
				"id": "33685267",
				"title": "19: Titanium Studio 1.0.7"
			}, {
				"description": "The Titanium Mobile 1.8 SDK is here and it comes with a whole bag of goodies! Here's just a short list of some of the highlights:<br>* Dual runtime support for both Rhino and the newly integrated V8 engine for Android<br>* The Mobile Web Beta SDK is now integrated into Titanium Mobile<br>* 2 new gestures: `longpress` and `pinch`<br>* Android VideoPlayers can now be embedded<br>* Full XML DOM Level 2 support on both Android and iOS<br>* Support for the iOS 5.0.1 \"do-not-back-up\" file attribute<br>And there's a whole lot more. Be sure to watch this screencast to see a number of these new features and parity alignments in action!",
				"thumb": "http://b.vimeocdn.com/ts/229/753/229753906_100.jpg",
				"id": "33806540",
				"title": "20: Titanium Mobile 1.8"
			}, {
				"description": "Blog post: developer.appcelerator.com/blog/?p=18288<br>This episode of Forging Titanium will give you an overview of what Box is and how you can integrate into your own apps using the Box Titanium module. We'll walk through getting your Box account set up, getting API keys, and then integrating Box's SDK into your own app via the Titanium module. In a few short minutes you will have free, integrated cloud storage services in your Titanium apps!",
				"thumb": "http://b.vimeocdn.com/ts/249/956/249956222_100.jpg",
				"id": "36444322",
				"title": "21: Box Module for Cloud Storage"
			}, {
				"description": "Blog post: developer.appcelerator.com/blog/?p=18406<br>Today we're going to do something a little different with Forging Titanium. We're going to take a popular app from the wild and see how we can implement some of its features in Titanium. Today's target: the animated menu from the Path mobile app.<br>In this episode we'll cover topics like:<br>* Advanced animation techniques<br>* Rotating and scaling UI components<br>* Native iOS module development<br>* Cross-platform considerations<br>* Titanium extensibility<br>With these techniques, we'll not only show you that Titanium can execute and perform as well as its native counterpart, but also do so from a single code base.",
				"thumb": "http://b.vimeocdn.com/ts/252/850/252850712_100.jpg",
				"id": "36846582",
				"title": "22: Path-like Menu"
			}, {
				"description": "Blog post: developer.appcelerator.com/blog/?p=18639<br>We're really excited about this episode of Forging Titanium because it's the first done by a member of the community. David Bankier is the creator of TiShadow, a client-server application built with the intention of rapidly deploying and testing Titanium apps on multiple devices. It's inspiration comes from Adobe's new labs product, not suprisingly named Shadow.<br><br>Increasing my development iteration speed is always a primary focus for me. A tool like TiShadow could be tremendous in that respect. Without further ado, I'll let David show you exactly how TiShadow could change the way you develop with Titanium.",
				"thumb": "http://b.vimeocdn.com/ts/265/234/265234436_100.jpg",
				"id": "38525908",
				"title": "22: TiShadow"
			}
		],
		"title": "Forging Titanium"
	}, {
		"items": [
			{
				"description": "Your mobile app deserves more exposure. Blast through the charts with a HD video showcasing your mobile app.",
				"thumb": "http://b.vimeocdn.com/ts/196/493/196493116_100.jpg",
				"id": "29345966",
				"title": "Sponsor: Vungle"
			}, {
				"description": "Millennial Media is the leading independent mobile advertising and data platform.",
				"thumb": "http://b.vimeocdn.com/ts/196/414/196414499_100.jpg",
				"id": "29338053",
				"title": "Sponsor: Millennial Media"
			}, {
				"description": "Mopapp tracks & analyzes your mobile apps' sales, generating easy-to-understand reports. Know more about your market and customers.",
				"thumb": "http://b.vimeocdn.com/ts/196/447/196447637_100.jpg",
				"id": "29341403",
				"title": "Sponsor: Mopapp"
			}, {
				"description": "By combining the end-to-end capabilities of eBay, PayPal, Magento and other commerce leaders in a single platform, X.commerce is radically transforming the retail landscape.",
				"thumb": "http://b.vimeocdn.com/ts/196/492/196492700_100.jpg",
				"id": "29345861",
				"title": "Sponsor: X.commerce"
			}, {
				"description": "ACE for Advertisers is the first end-to-end, buy-side video campaign management system architected to serve the needs of media agencies, advertisers, and agency trading desks.",
				"thumb": "http://b.vimeocdn.com/ts/196/449/196449082_100.jpg",
				"id": "29341480",
				"title": "Sponsor: YuMe"
			}, {
				"description": "We’re AppCentral™, the Mobile Application Management people. Our self-service Enterprise Mobile App Storefront makes it easy to distribute, secure and manage mobile apps without getting tangled up in your users’ personal stuff.",
				"thumb": "http://b.vimeocdn.com/ts/196/475/196475614_100.jpg",
				"id": "29343885",
				"title": "Sponsor: AppCentral"
			}, {
				"description": "Twilio provides infrastructure APIs for businesses to build scalable, reliable voice and text messaging apps.",
				"thumb": "http://b.vimeocdn.com/ts/196/455/196455840_100.jpg",
				"id": "29342140",
				"title": "Sponsor: Twilio"
			}, {
				"description": "",
				"thumb": "http://b.vimeocdn.com/ts/196/087/196087492_100.jpg",
				"id": "29292203",
				"title": "Interview: Srikanth Nandiraju"
			}, {
				"description": "",
				"thumb": "http://b.vimeocdn.com/ts/196/087/196087647_100.jpg",
				"id": "29292163",
				"title": "Interview: Marco Cota"
			}, {
				"description": "",
				"thumb": "http://b.vimeocdn.com/ts/196/060/196060269_100.jpg",
				"id": "29288893",
				"title": "Interview: Chris Toswill"
			}, {
				"description": "",
				"thumb": "http://b.vimeocdn.com/ts/196/054/196054563_100.jpg",
				"id": "29288220",
				"title": "Interview: Raphael Intrieri"
			}, {
				"description": "",
				"thumb": "http://b.vimeocdn.com/ts/196/047/196047470_100.jpg",
				"id": "29287350",
				"title": "Interview: Ketan Majmudar"
			}, {
				"description": "",
				"thumb": "http://b.vimeocdn.com/ts/196/035/196035448_100.jpg",
				"id": "29285871",
				"title": "Interview: James Childs"
			}, {
				"description": "Barnes & Noble interview at Codestrong Conference including a special announcement.",
				"thumb": "http://b.vimeocdn.com/ts/196/109/196109922_100.jpg",
				"id": "29294922",
				"title": "Sponsor: Barnes & Noble"
			}, {
				"description": "CEO Jeff Haynie takes the stage for the first time for CODESTRONG 2011.",
				"thumb": "http://b.vimeocdn.com/ts/196/024/196024600_100.jpg",
				"id": "29284520",
				"title": "CODESTRONG Kick Off"
			}, {
				"description": "The day before CODESTRONG we had a pre-party to welcome everyone, and were able to get some peoples thoughts on the event.",
				"thumb": "http://b.vimeocdn.com/ts/195/979/195979155_100.jpg",
				"id": "29278171",
				"title": "CODESTRONG 2011 Pre-Party"
			}, {
				"description": "With more than 1.5 million developers worldwide, Appcelerator's ecosystem is a key part of its developers' success. Nolan Wright, Appcelerator's CTO, will discuss how ISVs like PayPal and Box.net are adding great fuel to the Titanium development fire with new capabilities and resources for mobile developers.<br>Nolan Wright, Co-founder and CTO, leads engineering and product management at Appcelerator.",
				"thumb": "http://b.vimeocdn.com/ts/198/968/198968936_100.jpg",
				"id": "29683949",
				"title": "Nolan Wright: Appcelerator's World-Class Ecosystem"
			}, {
				"description": "Companies are building amazing companies on top of their Titanium-powered apps. Hotel Tonight was the #1 Travel App, GetGlue was the #2 Social Networking App, Hotel Tonight passed 500k downloads within a five months of launch, and Gamestop has super-charged their PowerUp loyalty program using their mobile app.<br>How have these companies achieved such great successes? How have they used mobile as a competitive edge? How did Titanium help get them there?<br>Scott Schwarzhoff, Appcelerator's VP of Marketing will ask these questions and more during this exciting panel with some of Appcelerator's most successful customers.",
				"thumb": "http://b.vimeocdn.com/ts/198/898/198898674_100.jpg",
				"id": "29674177",
				"title": "Scott Schwarzhoff: Building Wildly Successful Apps on Titanium"
			}, {
				"description": "Developers have built more than 25,000 mobile apps on Titanium and have unleashed them onto the world. Some of these apps have been built by the world's best brands like NBC, Kelloggs, and Medtronic. Hear from these companies how they created amazing user experiences for their customers, how mobile has impacted their business, and why Titanium was the best choice to power their apps.<br>Jeff Haynie, Appcelerator's CEO, will discuss how these great brands have built world-class apps on Titanium. Jeff Haynie is Co-founder and CEO of Appcelerator. Jeff is a long-time serial entrepreneur, technologist and blogger.",
				"thumb": "http://b.vimeocdn.com/ts/199/512/199512083_100.jpg",
				"id": "29675540",
				"title": "Jeff Haynie: Building World Class Mobile Experiences on Titanium"
			}, {
				"description": "The Shiny Objects module discussed in this session will allow the developer to easily add visually appealing buttons to their projects without the use of special graphics files. Make a button that really shines with a call as simple as Ti.UI.createButton!<br>See how easy it was to create this module and benefit from the lessons learned during its development.<br>Why All the Fuss?<br>The stock button provided by Apple is plain and boring. It lacks the depth, color and presence of the standard Apple buttons. The standard buttons are mostly available for use in the navigation bar and cannot be put together in a view to add multiple buttons.<br>This session will be of most interest to intermediate and advanced developers looking to create or extend Titanium functionality, but is also quite useful for the beginning developer to learn how to easily add a cool looking button to their projects. Objective-C and Java will be discussed but are not necessary to use this module.<br>Module Benefits<br>- Shine and Gloss Using Gradient Layers<br>- Consistent Look and Feel for iPhone and Android Apps<br>- Ability to Change the Button Background color with a Property<br>- Adjustable Border Radius<br>- Automatic Highlighting",
				"thumb": "http://b.vimeocdn.com/ts/202/353/202353344_100.jpg",
				"id": "30148453",
				"title": "Scott Mason: Enhancing the User Interface Using Titanium Modules"
			}, {
				"description": "The mobile commerce is on the rise and various research reports from analysts shows that mobile commerce will hit the $6 billion in 2011 and will grow up to $31 billion by 2016. PayPal today processes about $10 million in mobile TPV (total payment volume) a day and is estimated to process up to $3 billion in mobile TPV for the year 2011. In this session, we will go over how you can use PayPal In-App payments in your mobile application to process payments for a variety of use cases and how to use can use the mobile payments capability provided by the commerce module for Titanium to build your iOS and Android apps.<br>In this session, you will learn about<br>1. PayPal Mobile Payments Library<br>2. PayPal Mobile Express Checkout<br>3. Implementation walk through<br>4. Next steps (going live, tech support)",
				"thumb": "http://b.vimeocdn.com/ts/202/330/202330659_100.jpg",
				"id": "30145620",
				"title": "Srikanth Nandiraju: Monetize Your Mobile Apps Using Titanium Commerce Mobile"
			}, {
				"description": "rom the launch of the iPhone and subsequent opening of the iOS to developers, to Android OS and now tablets, we’ve seen the surge in mobile software development. Not only has the industry grown exponentially, but it has expanded into new demographics – and in particular, the latest innovations are enabling developers to create business-grade solutions on mobile devices.<br>The entrance of enterprise customers into the mobile industry comes as no surprise. In recent years, SaaS solutions have gone beyond consumer services as well, expanding on the precedent set by Salesforce.com. And all the while the API craze continued from 2009 onward. creating an excellent point of synergy.<br>For mobile developers interested in building business-grade applications, here you’ll learn tips and tricks for working with Enterprise SaaS APIs. We’ll highlight the business opportunities for mobile development in the space, and the technical opportunities in adding SaaS solutions to your applications.",
				"thumb": "http://b.vimeocdn.com/ts/204/045/204045852_100.jpg",
				"id": "30384570",
				"title": "Jeremy Glassenberg: Using Titanium to Connect to Enterprise SaaS"
			}, {
				"description": "Javascript is a fantastic language and the lingua franca of the Web. But can you use Javascript to control hardware? Titanium already does a great job of supporting hardware over iOS & Android, such as the accelerometer and the camera. But what about other hardware? Can you use Titanium to turn on Wifi or Bluetooth radios? How about other sensors like the Barometer on the Motorola XOOM?<br>It turns out that the flexibility of the Titanium+Plus allows all of this and more.<br>This talk discusses the ups and down of developing Titanium+Plus modules specifically for hardware like Wifi and Bluetooth. We will also discuss some aspects of doing localization for Titanium+Plus in Android.",
				"thumb": "http://b.vimeocdn.com/ts/204/059/204059288_100.jpg",
				"id": "30386340",
				"title": "Rob Chohan: Titanium+Plus Modules and Javascript Bridges: Controlling Hardware with a Web Language"
			}, {
				"description": "Augmented Reality (AR) is the next step in presenting location data. See how Titanium Mobile enables you to create cross platform AR Apps using common APIs such as Groupon, Yelp, Twitter, and others.<br>Learn how to use GeoNames, Google and other third party services to extend Titanium's Geolocation functionality. Example source will be provided on how you can chain different location services to handle different accuracy and availability requirements.<br>Compare different AR presentation patterns and how they are implemented cross platform. Learn how to used the camera overlay and other UI elements to effectively present geolocation data.<br>The Titanium Platform provides a rich framework to build AR Applications upon. Using the TiAR sample application we will discuss a series of patterns and approaches on how to build AR into your Apps. The TiAR sample application will be available upon github before the conference begins.",
				"thumb": "http://b.vimeocdn.com/ts/204/100/204100190_100.jpg",
				"id": "30391729",
				"title": "Ben Bahrenburg: Augmented Reality Using Titanium"
			}, {
				"description": "What if we could bring the good parts of web development to Titanium? I'm talking about the realtimeness of web development - changing files and being able to see results on the fly, both visually and regarding application logic. Compare it to Firebug's live CSS editing abilities and Chrome's live code changes. I'm also talking about bringing the beauty of web frameworks to Titanium - Stylus, SASS and Less for styling, CoffeeScript and its cousins to enhance development, Jasmine for testing, Backbone for MVC and jQuery and friends to simplify element creation, communication and handling. What if we could use all these techniques on top of Titanium to create native apps even faster and with better structure?<br>The solution is Kranium - the result of merging Titanium with web development techniques, creating a cyborg which is greater than just the sum of its parts. It will significantly speed up development and styling, and is useful both for prototyping and production apps. It will be release under the MIT license during the conference. The session is meant as an introduction of Kranium for all Titanium developers, but will be especially thrilling for those with a web development background.",
				"thumb": "http://b.vimeocdn.com/ts/204/091/204091576_100.jpg",
				"id": "30391192",
				"title": "Jacob Waller: Webifying Titanium Development"
			}, {
				"description": "The Titanium OpenGL Module (Ti.OpenGL) opens the door to sophisticated graphics development for the Titanium programmer by exposing the entire OpenGL ES 1 and ES 2 graphics API to the Ti Javascript environment. The Ti.OpenGL view extends Ti.UI.View with a graphics rendering canvas that is easily managed within the Titanium view hierarchy. In addition, the module provides a databuffer object to hold large datasets and mitigate any inefficiency that arises from modeling datasets in Javascript.<br>This talk demonstrates the pragmatics of building sophisticated graphics displays using Ti.OpenGL in both ES 1 and ES 2. It will reveal several reusable design abstractions that take advantage of features of the Javascript environment. Among the topics to be covered are:<br>- OpenGL basic setup and animation<br>- Use of databuffers for attribute and index arrays<br>- Connecting databuffers and vertex buffer objects (vbo’s)<br>- Using external resources (textures, shaders, etc.)",
				"thumb": "http://b.vimeocdn.com/ts/204/073/204073729_100.jpg",
				"id": "30387872",
				"title": "Richard Salter: Using the Titanium OpenGL Module"
			}, {
				"description": "Mobile applications often need to manipulate data in databases: news, contents, user preferences, etc. Titanium Mobile proposes a complete API, allowing to create databases and manipulate their content, but this module remains low level, as it does not offer the abstraction provided by ORMs (Object Relational Mappers).<br>This session introduces, through concrete examples, the advantages provided by the use of database abstraction tools.<br>It will list the available javascript ORMs on the market, depicting their differences, and will focus on joli.js, the lightweight still complete ORM published by the speaker. The attendees will learn how to take the best out of this ORM, will be taught about its useful querying model, and will learn how to extend it.<br>As a conclusion, a simple web services consumer extension of joli.js will be presented, which allows to consume web services and put their responses in a database through the very same API as joli.js.",
				"thumb": "http://b.vimeocdn.com/ts/202/314/202314791_100.jpg",
				"id": "30143695",
				"title": "Xavier Lacot: Abstracting Databases Access in Titanium Mobile"
			}, {
				"description": "You've developed your Titanium application, published to the app store, and started thinking about doing more. In this session, you'll learn some of the architectural and code related tips for using Titanium as a platform for building a suite of similar products for your venture.<br>Perhaps you want to make that extra feature available as an in-app upgrade, or provide HD sound as an option to your users. Whether it's for the enterprise or for the consumer, we'll look at tips n' tricks for extending and evolving your app.<br>In this session, we'll cover databases, switching user-content based on data, doing upgrades over the air, building an \"app suite platform\" using Titanium, managing upgrades, migrating data between versions and more. Strap yourself in for a fast-paced session!",
				"thumb": "http://b.vimeocdn.com/ts/202/061/202061277_100.jpg",
				"id": "30108868",
				"title": "Pratik Patel: Titanium as Platform: Feature-Rich, Database-Driven Mobile Apps"
			}, {
				"description": "Millions of apps have been downloaded by NOOK Color customers in the weeks following the launch of NOOK Apps and they’re asking for more.<br>Join us for a session on how to build applications for NOOK Apps. We will deep dive into leveraging Titanium Studio to develop applications for NOOK Color and cover the entire development process from app creation to the app submission process. Learn how to quickly monetize your applications in a storefront where the top-selling apps grossed more than $100,000 in the first 30 days.",
				"thumb": "http://b.vimeocdn.com/ts/202/038/202038015_100.jpg",
				"id": "30107022",
				"title": "Ted Patrick: Developing Apps for the Barnes & Noble NOOK"
			}, {
				"description": "This presentation will give an overview of some of the many accepted methods of creating a great User Experience on mobile devices. While developing an application for a mobile device, we recognize many of the ‘physical’ differences, ie. a smaller visual real estate, size of text and buttons, etc but we should be cognizant of creating a great experience too.<br>Designing for mobile devices brings some unique situations and challenges, it requires a strategic approach for the User Experience (UX) and User Interface (UI) composition.<br>This presentation will talk about current trends, challenges, tips to take advantage of while working with Titanium.<br>What to Expect:<br>- Using .jss<br>- Use-cases for animations<br>- Tips on keeps things simple<br>- User Interface & User Experience tips<br>- Buttons!!<br>- Lessons Learned<br>Vince Baskerville is VP of Production at TripLingo.",
				"thumb": "http://b.vimeocdn.com/ts/202/020/202020063_100.jpg",
				"id": "30106230",
				"title": "Vince Baskerville: Designing an Awesome Mobile User Experience"
			}, {
				"description": "Ketan Majmudar shows how and why he chose Titanium over other web based technologies for delivering apps that are out into the \"real world\", with two case studies (an app being deployed to a district of the Surrey Police Force within the UK & the SCI-FI-LONDON Film Festival).<br>This talk is aimed at beginners, intermediate developers and decision makers to gauge the benefits and take away tips for use in planning and building your first Titanium apps.<br>You will learn:<br>App Structure<br>Cross Platform Considerations<br>Testing Solutions<br>Twitter & oAuth<br>Quick-fixes for AppStore<br>Getting Help & Resources<br>Ketan steps you through his experiences from coding his first app, to using the Kitchen Sink, to a more structured second app. You will find useful tips and libraries that will help enable your app to talk to twitter cross platform and how I got feedback during the development.",
				"thumb": "http://b.vimeocdn.com/ts/201/878/201878022_100.jpg",
				"id": "30085639",
				"title": "Ketan Majmudar: From Kitchen Sink to App: Real World Case Studies"
			}, {
				"description": "JavaScript and Titanium's JavaScript Stylesheets would be the quickest way to develop native mobile applications if it weren't for CoffeeScript and Sass. This talk will show you how to speed up your dev cycles and use CoffeeScript and Sass not only to write code faster, but better organize your JavaScript and JSS.",
				"thumb": "http://b.vimeocdn.com/ts/202/701/202701900_100.jpg",
				"id": "30195860",
				"title": "Wynn Netherland: Accelerating Titanium Development with CoffeeScript, Compass, and Sass"
			}, {
				"description": "The cornerstone of UX, user interface design presents unique, user-centric challenges, exposing exciting opportunities to produce cohesive and engaging interactive experiences. Covering mobile-specific UI principles, practical implementation and rule breaking, Fred Spencer will share with you how the Titanium platform can make it easy to meaningfully improve user experience and exceed user expectations.<br>Located in the greater Boston area, Fred Spencer is an Appcelerator senior application architect and digital media instructor at the Rhode Island School of Design, Continuing Education.",
				"thumb": "http://b.vimeocdn.com/ts/201/543/201543376_100.jpg",
				"id": "30038852",
				"title": "Fred Spencer: Designing a Great UI"
			}, {
				"description": "One of the main reasons Titanium Mobile has been so successful is that the technology has significantly lowered the barrier to entry for native mobile development. A major force behind this is JavaScript, Titanium's primary programming language. The JavaScript programming language is small enough where the basics can be learned in a matter of hours, which has enabled developers from many different backgrounds to become productive using Titanium. But there's much more to JavaScript than just control structures and a handful of primitive data types - JavaScript is a beautiful functional programming language with great features you might not be using.<br>Most developers working on the web today have had some exposure to JavaScript, but there's a difference between using jQuery for DOM manipulation on a web page and writing an entire application in JavaScript. This talk, intended for beginner or intermediate JavaScript developers, will focus on the essential language features you will need to write professional JavaScript applications, including but not limited to:<br>Object Oriented Programming in JavaScript<br>The Good Parts and Bad Parts of JavaScript<br>Useful JavaScript Patterns, Tricks, and Style Guidelines<br>The JavaScript runtime in Titanium Mobile<br>Further Reading and ways to stay up to date on JavaScript",
				"thumb": "http://b.vimeocdn.com/ts/201/533/201533703_100.jpg",
				"id": "30035164",
				"title": "Kevin Whinnery: Write Better JavaScript"
			}, {
				"description": "The ability to extend your application with custom functionality, whether an external library or your own custom library, opens up numerous possibilities for what you can create. Titanium enables this with what are called 'modules'. Modules provide a bridge between your Javascript application code and your native library code. Getting started writing your own modules can seem confusing, but once your understand the architecture of a module and how it integrates with the Titanium platform you will be able to add your own functionality in short order.<br>In this session you will learn:<br>How to create your module project<br>How to call methods and pass parameters to your module from your Javascript code<br>How to make callbacks into your Javascript code from your module<br>This session is for anyone interested in understanding module development and how to get started.<br>Jeff English is the Modules Development Manager at Appcelerator. Jeff and his team designed and developed many of the Appcelerator modules found in the Marketplace.",
				"thumb": "http://b.vimeocdn.com/ts/201/201/201201777_100.jpg",
				"id": "29993359",
				"title": "Jeff English: Demystifying Module Development - How to Extend Titanium"
			}, {
				"description": "Have questions about how to script or integrate a desired feature? Titanium Studio offers a wealth of opportunities for modifying and extending behavior through both Eclipse plugins and Rubles, Studio's own scripting interface.<br>Ingo Muschenetz, Director of Tools Engineering, will lead a deep dive into the scripting interface of Titanium Studio to show how you can customize and extend Studio to better fit your preferences and workflow. We'll cover themes, scopes, commands, snippets, project templates and content assist showing possible approaches and solutions to easily modifying existing functionality, providing your own, and sharing with others.<br>This session is for developers of all skill levels, with discussion and explanation of several use cases.<br>Ingo Muschenetz is Appcelerator's Director, Tools Engineering, Appcelerator. He leads the development efforts for the Titanium Studio and Aptana Studio products .",
				"thumb": "http://b.vimeocdn.com/ts/201/207/201207913_100.jpg",
				"id": "29994058",
				"title": "Ingo Muschenetz: Titanium Studio Deep Dive"
			}, {
				"description": "Kevin Whinnery, Appcelerator Evangelist, shares best practices for creating mobile apps for cross-device deployment. Titanium Mobile is not a \"write once, run everywhere\" technology solution. Because Titanium provides the platform-specific APIs necessary to create best of breed native applications, the way in which you approach user interface development on one platform might differ significantly for another platform. It is, however, very possible to \"write once, adapt everywhere\" - to provide rich native experiences while achieving maximum code reuse.<br>In this presentation, we will cover real world techniques for maximizing code reuse while leveraging platform-specific APIs in Titanium applications. Come with questions, and leave with multiple projects and code examples showing techniques Titanium developers use today to deliver sophisticated and performant cross-platform applications.",
				"thumb": "http://b.vimeocdn.com/ts/199/482/199482580_100.jpg",
				"id": "29754525",
				"title": "Kevin Whinnery: Best Practices for Cross-Platform Mobile Development"
			}, {
				"description": "Developing large-scale Titanium apps can be tricky. Although Titanium manages memory on the native level for developers, care and attention on memory management and profiling techniques must be used in order to ensure their javascript is optimial. Attendees will learn how to detect memory leak / retention issues caused by client-side code. They will learn how to utilize tools and techniques such as Instruments / DDMS, proper architectural patterns, and more to produce performant apps.<br>Appcelerator's Rick Blalock leads this session for developers who have a a strong grasp of Titanium but want to learn how to profile and improve the apps they build.",
				"thumb": "http://b.vimeocdn.com/ts/199/854/199854482_100.jpg",
				"id": "29804284",
				"title": "Rick Blalock: Your Apps are Leaking - Controlling Memory Leaks"
			}, {
				"description": "In this presentation, we discuss taking advantage of native iOS features on Titanium both through code and configuration, as well as how to use Apple's toolchain for iOS development to be more productive and produce better products.<br>Some topics that we'll cover include:<br>Using Apple's toolchain:<br>- Debugging app internals<br>- Custom-configuring plists<br>- Titanium 'export' and switching to xcode<br>APIs & Titanium:<br>- iOS-specific tiapp.xml settings<br>- App lifecycle on iOS<br>- View lifecycles & layout<br>- Memory management 'gotchas'",
				"thumb": "http://b.vimeocdn.com/ts/199/880/199880976_100.jpg",
				"id": "29807421",
				"title": "Fred Spencer & Blain Hamon: Advanced Titanium for iOS"
			}, {
				"description": "In this presentation, we will provide an overview of native Android tooling and some of its uses. We will also cover several Android specific concepts and APIs and discuss how you can use them when creating a best of breed application.<br>Tooling<br>- DDMS<br>- adb (Android Debug Bridge)<br>- android (Downloading SDKs, Managing AVDs)<br>APIs<br>- Android Lifecycle Events<br>- Intents, Activities, Notifications<br>- Javascript Activities<br>- Resources<br>- Android Section of tiapp.xml",
				"thumb": "http://b.vimeocdn.com/ts/199/482/199482246_100.jpg",
				"id": "29754302",
				"title": "Don Thorp & Marshall Culpepper: Advanced Titanium Development for Android"
			}
		],
		"title": "CODESTRONG 2011"
	}
]
